---
type: MEPBuildingConstructionSetIterator
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 4
tags: [revit-api, class]
---

# MEPBuildingConstructionSetIterator

`Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSetIterator` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | MEPBuildingConstructionSetIterator | — | `public MEPBuildingConstructionSetIterator ()` |
| Method | MoveNext | — | `public virtual bool MoveNext ()` |
| Method | Reset | — | `public virtual void Reset ()` |
| Property | Current | — | `public virtual Object Current { get ; }` |